MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS504/mcu.h
#define _ADCMP0ENL_CMPEN9_POSITION               0x00000009
#define _ADCMP0ENL_CMPEN9_MASK                   0x00000200
#define _ADCMP0ENL_CMPEN9_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN10_POSITION              0x0000000A
#define _ADCMP0ENL_CMPEN10_MASK                  0x00000400
#define _ADCMP0ENL_CMPEN10_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN11_POSITION              0x0000000B
#define _ADCMP0ENL_CMPEN11_MASK                  0x00000800
#define _ADCMP0ENL_CMPEN11_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN12_POSITION              0x0000000C
#define _ADCMP0ENL_CMPEN12_MASK                  0x00001000
#define _ADCMP0ENL_CMPEN12_LENGTH                0x00000001

#define _ADCMP0ENL_CMPEN14_POSITION              0x0000000E
#define _ADCMP0ENL_CMPEN14_MASK                  0x00004000
#define _ADCMP0ENL_CMPEN14_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN17_POSITION              0x00000001
#define _ADCMP0ENH_CMPEN17_MASK                  0x00000002
#define _ADCMP0ENH_CMPEN17_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN18_POSITION              0x00000002
#define _ADCMP0ENH_CMPEN18_MASK                  0x00000004
#define _ADCMP0ENH_CMPEN18_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN19_POSITION              0x00000003
#define _ADCMP0ENH_CMPEN19_MASK                  0x00000008
#define _ADCMP0ENH_CMPEN19_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN20_POSITION              0x00000004
#define _ADCMP0ENH_CMPEN20_MASK                  0x00000010
#define _ADCMP0ENH_CMPEN20_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN21_POSITION              0x00000005
#define _ADCMP0ENH_CMPEN21_MASK                  0x00000020
#define _ADCMP0ENH_CMPEN21_LENGTH                0x00000001

#define _ADCMP1ENL_CMPEN0_POSITION               0x00000000
#define _ADCMP1ENL_CMPEN0_MASK                   0x00000001
#define _ADCMP1ENL_CMPEN0_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN1_POSITION               0x00000001
#define _ADCMP1ENL_CMPEN1_MASK                   0x00000002
#define _ADCMP1ENL_CMPEN1_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN2_POSITION               0x00000002
#define _ADCMP1ENL_CMPEN2_MASK                   0x00000004
#define _ADCMP1ENL_CMPEN2_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN3_POSITION               0x00000003
#define _ADCMP1ENL_CMPEN3_MASK                   0x00000008
#define _ADCMP1ENL_CMPEN3_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN4_POSITION               0x00000004
#define _ADCMP1ENL_CMPEN4_MASK                   0x00000010
#define _ADCMP1ENL_CMPEN4_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN5_POSITION               0x00000005
#define _ADCMP1ENL_CMPEN5_MASK                   0x00000020
#define _ADCMP1ENL_CMPEN5_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN6_POSITION               0x00000006
#define _ADCMP1ENL_CMPEN6_MASK                   0x00000040
#define _ADCMP1ENL_CMPEN6_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN7_POSITION               0x00000007
#define _ADCMP1ENL_CMPEN7_MASK                   0x00000080
#define _ADCMP1ENL_CMPEN7_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN8_POSITION               0x00000008
#define _ADCMP1ENL_CMPEN8_MASK                   0x00000100
#define _ADCMP1ENL_CMPEN8_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN9_POSITION               0x00000009
#define _ADCMP1ENL_CMPEN9_MASK                   0x00000200
#define _ADCMP1ENL_CMPEN9_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN10_POSITION              0x0000000A
#define _ADCMP1ENL_CMPEN10_MASK                  0x00000400
#define _ADCMP1ENL_CMPEN10_LENGTH                0x00000001

#define _ADCMP1ENL_CMPEN11_POSITION              0x0000000B
#define _ADCMP1ENL_CMPEN11_MASK                  0x00000800
#define _ADCMP1ENL_CMPEN11_LENGTH                0x00000001

#define _ADCMP1ENL_CMPEN12_POSITION              0x0000000C
#define _ADCMP1ENL_CMPEN12_MASK                  0x00001000
#define _ADCMP1ENL_CMPEN12_LENGTH                0x00000001

#define _ADCMP1ENL_CMPEN14_POSITION              0x0000000E
#define _ADCMP1ENL_CMPEN14_MASK                  0x00004000
#define _ADCMP1ENL_CMPEN14_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN17_POSITION              0x00000001
#define _ADCMP1ENH_CMPEN17_MASK                  0x00000002
#define _ADCMP1ENH_CMPEN17_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN18_POSITION              0x00000002
#define _ADCMP1ENH_CMPEN18_MASK                  0x00000004
#define _ADCMP1ENH_CMPEN18_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN19_POSITION              0x00000003
#define _ADCMP1ENH_CMPEN19_MASK                  0x00000008
#define _ADCMP1ENH_CMPEN19_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN20_POSITION              0x00000004
#define _ADCMP1ENH_CMPEN20_MASK                  0x00000010
#define _ADCMP1ENH_CMPEN20_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN21_POSITION              0x00000005
#define _ADCMP1ENH_CMPEN21_MASK                  0x00000020
#define _ADCMP1ENH_CMPEN21_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL_POSITION               0x00000000
#define _ADFL0CON_FLCHSEL_MASK                   0x0000001F
#define _ADFL0CON_FLCHSEL_LENGTH                 0x00000005

#define _ADFL0CON_RDY_POSITION                   0x00000008
#define _ADFL0CON_RDY_MASK                       0x00000100
#define _ADFL0CON_RDY_LENGTH                     0x00000001

#define _ADFL0CON_IE_POSITION                    0x00000009
#define _ADFL0CON_IE_MASK                        0x00000200
#define _ADFL0CON_IE_LENGTH                      0x00000001

#define _ADFL0CON_OVRSAM_POSITION                0x0000000A
#define _ADFL0CON_OVRSAM_MASK                    0x00001C00
#define _ADFL0CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL0CON_MODE_POSITION                  0x0000000D
#define _ADFL0CON_MODE_MASK                      0x00006000
#define _ADFL0CON_MODE_LENGTH                    0x00000002

